Exercise 3: Sorting & Ranking

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Name": ["Aman", "Saurav", "Karan", "shubham", "Abhishek", None, "sameer"],
    "Age": [22, 23, None, 22, 25, 24, 26],
    "Marks": [85, None, 88, 90, 56, 72, None],
    "Subject": ["Math", "Physics", "Math", "Chemistry", "Math", "Physics", "Chemistry"]
})

df

       Name   Age  Marks    Subject
0      Aman  22.0   85.0       Math
1    Saurav  23.0    NaN    Physics
2     Karan   NaN   88.0       Math
3   shubham  22.0   90.0  Chemistry
4  Abhishek  25.0   56.0       Math
5       NaN  24.0   72.0    Physics
6    sameer  26.0    NaN  Chemistry

In [3]:
df_sort = df.sort_values(by="Marks", ascending=False)
df_sort

       Name   Age  Marks    Subject
3   shubham  22.0   90.0  Chemistry
2     Karan   NaN   88.0       Math
0      Aman  22.0   85.0       Math
5       NaN  24.0   72.0    Physics
4  Abhishek  25.0   56.0       Math
1    Saurav  23.0    NaN    Physics
6    sameer  26.0    NaN  Chemistry

In [4]:
top_2 = df.nlargest(2, "Marks")
top_2

      Name   Age  Marks    Subject
3  shubham  22.0   90.0  Chemistry
2    Karan   NaN   88.0       Math

In [5]:
lowest = df.nsmallest(1, "Marks")
lowest

       Name   Age  Marks Subject
4  Abhishek  25.0   56.0    Math